---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateSurfaceGeometryInfo(System.Double)
source: html/f8c08a08-7bf4-48b3-73e9-f34a449bc890.htm
---
# Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateSurfaceGeometryInfo Method

Creates a new container object which holds IfcSurface handles processed from a Revit geometry object.

## Syntax (C#)
```csharp
public static IFCGeometryInfo CreateSurfaceGeometryInfo(
	double epsilon
)
```

## Parameters
- **epsilon** (`System.Double`) - The epsilon value used to process surfaces.

## Returns
The new geometry info container.